{
  "types": {
    "CRM Customer Relationship Management": [
      "Lead",
      "Contact",
      "Account",
      "Product",
      "SalesOrder"
    ],
    "WMS Warehouse Management System": [
      "Warehouse",
      "InStock",
      "OutStock",
      "Stock"
    ]
  },
  "schemas": [
    {
      "name": "Lead",
      "desc": "A lead is the initial information obtained from the first contact with a customer. This could be a business card from a trade show, a phone number obtained through promotional activities, or basic customer information acquired from meetings, advertisements, or external purchases. Leads can be converted into customers through management and follow-up.",
      "key": "Lead",
      "file": "schema-Lead.json",
      "refs": [
        "Account"
      ]
    },
    {
      "name": "Contact",
      "desc": "A contact is a relevant individual on the customer side who is in direct communication with the business. For business clients, the contact is the person who communicates with the company. For individual clients, a contact could be a person associated with the client who assists in communication.",
      "key": "Contact",
      "file": "schema-Contact.json",
      "refs": [
        "Account"
      ]
    },
    {
      "name": "Account",
      "desc": "An account represents a business, organization, or individual that has business dealings with the company. Accounts are valuable resources for the company and can be converted from leads or acquired through sales outreach and various other channels.",
      "key": "Account",
      "file": "schema-Account.json",
      "refs": [
        "Lead"
      ]
    },    
    {
      "name": "Product",
      "desc": "A product is any valuable item, service, information, manpower, organization, or combination thereof that the company provides to customers. Products can be tangible or intangible, but they are all measurable by some unit or combination of units, reflecting their value. As the core of the company's service offerings, the entire company's marketing activities revolve around its products.",
      "key": "Product",
      "file": "schema-Product.json",
      "refs": []
    },
    {
      "name": "Sales Order",
      "desc": "A sales order is a sales agreement between the company and a customer. It facilitates communication between the company and the customer, representing a customer’s request for goods for sale and the company’s commitment to the sale. By managing and maintaining order information, the company can exercise planned control over sales, ensuring that its sales, production, and procurement activities remain orderly, smooth, and efficient.",
      "key": "SalesOrder",
      "file": "schema-SalesOrder.json",
      "refs": [
        "Account",
        "Contact",
        "Product"
      ]
    },
    {
      "name": "Warehouse",
      "desc": "A warehouse is a place designated for storing goods.",
      "key": "Warehouse",
      "file": "schema-Warehouse.json",
      "refs": []
    },
    {
      "name": "In Stock",
      "desc": "In stock is the confirmation of the quantity of goods entering the warehouse.",
      "key": "InStock",
      "file": "schema-InStock.json",
      "refs": [
        "Warehouse",
        "Product"
      ]
    },
    {
      "name": "Out Stock",
      "desc": "Out stock is the confirmation of the quantity of goods leaving the warehouse.",
      "key": "OutStock",
      "file": "schema-OutStock.json",
      "refs": [
        "Warehouse",
        "Product"
      ]
    },
    {
      "name": "Stock",
      "desc": "Stock refers to the actual goods stored within a warehouse.",
      "key": "Stock",
      "file": "schema-Stock.json",
      "refs": [
        "Warehouse",
        "Product"
      ]
    }
    
  ]
}